; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	thermograph1 - mode
	image2 - mode
	spectrograph0 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star3 - direction
	Phenomenon4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon6)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 129)
	(supports instrument1 spectrograph0)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 spectrograph0)
	(supports instrument2 image2)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 105)
	(= (data Phenomenon4 thermograph1) 197)
	(= (data Planet5 thermograph1) 210)
	(= (data Phenomenon6 thermograph1) 250)
	(= (data Planet7 thermograph1) 274)
	(= (data Planet8 thermograph1) 55)
	(= (data Planet9 thermograph1) 262)
	(= (data Phenomenon4 image2) 154)
	(= (data Planet5 image2) 107)
	(= (data Phenomenon6 image2) 241)
	(= (data Planet7 image2) 71)
	(= (data Planet8 image2) 126)
	(= (data Planet9 image2) 54)
	(= (data Phenomenon4 spectrograph0) 255)
	(= (data Planet5 spectrograph0) 148)
	(= (data Phenomenon6 spectrograph0) 151)
	(= (data Planet7 spectrograph0) 224)
	(= (data Planet8 spectrograph0) 240)
	(= (data Planet9 spectrograph0) 21)
	(= (slew_time GroundStation1 GroundStation0) 24.37)
	(= (slew_time GroundStation0 GroundStation1) 24.37)
	(= (slew_time GroundStation2 GroundStation0) 7.34)
	(= (slew_time GroundStation0 GroundStation2) 7.34)
	(= (slew_time GroundStation2 GroundStation1) 41.49)
	(= (slew_time GroundStation1 GroundStation2) 41.49)
	(= (slew_time Star3 GroundStation0) 33.3)
	(= (slew_time GroundStation0 Star3) 33.3)
	(= (slew_time Star3 GroundStation1) 18.56)
	(= (slew_time GroundStation1 Star3) 18.56)
	(= (slew_time Star3 GroundStation2) 11.5)
	(= (slew_time GroundStation2 Star3) 11.5)
	(= (slew_time Phenomenon4 GroundStation0) 32.61)
	(= (slew_time GroundStation0 Phenomenon4) 32.61)
	(= (slew_time Phenomenon4 GroundStation1) 16.32)
	(= (slew_time GroundStation1 Phenomenon4) 16.32)
	(= (slew_time Phenomenon4 GroundStation2) 19.56)
	(= (slew_time GroundStation2 Phenomenon4) 19.56)
	(= (slew_time Phenomenon4 Star3) 94.04)
	(= (slew_time Star3 Phenomenon4) 94.04)
	(= (slew_time Planet5 GroundStation0) 47.44)
	(= (slew_time GroundStation0 Planet5) 47.44)
	(= (slew_time Planet5 GroundStation1) 31.93)
	(= (slew_time GroundStation1 Planet5) 31.93)
	(= (slew_time Planet5 GroundStation2) 45.99)
	(= (slew_time GroundStation2 Planet5) 45.99)
	(= (slew_time Planet5 Star3) 31.8)
	(= (slew_time Star3 Planet5) 31.8)
	(= (slew_time Planet5 Phenomenon4) 6.235)
	(= (slew_time Phenomenon4 Planet5) 6.235)
	(= (slew_time Phenomenon6 GroundStation0) 28.8)
	(= (slew_time GroundStation0 Phenomenon6) 28.8)
	(= (slew_time Phenomenon6 GroundStation1) 7.841)
	(= (slew_time GroundStation1 Phenomenon6) 7.841)
	(= (slew_time Phenomenon6 GroundStation2) 77.43)
	(= (slew_time GroundStation2 Phenomenon6) 77.43)
	(= (slew_time Phenomenon6 Star3) 32.07)
	(= (slew_time Star3 Phenomenon6) 32.07)
	(= (slew_time Phenomenon6 Phenomenon4) 42.55)
	(= (slew_time Phenomenon4 Phenomenon6) 42.55)
	(= (slew_time Phenomenon6 Planet5) 28.41)
	(= (slew_time Planet5 Phenomenon6) 28.41)
	(= (slew_time Planet7 GroundStation0) 4.433)
	(= (slew_time GroundStation0 Planet7) 4.433)
	(= (slew_time Planet7 GroundStation1) 0.5155)
	(= (slew_time GroundStation1 Planet7) 0.5155)
	(= (slew_time Planet7 GroundStation2) 0.2861)
	(= (slew_time GroundStation2 Planet7) 0.2861)
	(= (slew_time Planet7 Star3) 1.661)
	(= (slew_time Star3 Planet7) 1.661)
	(= (slew_time Planet7 Phenomenon4) 52.36)
	(= (slew_time Phenomenon4 Planet7) 52.36)
	(= (slew_time Planet7 Planet5) 60.8)
	(= (slew_time Planet5 Planet7) 60.8)
	(= (slew_time Planet7 Phenomenon6) 6.383)
	(= (slew_time Phenomenon6 Planet7) 6.383)
	(= (slew_time Planet8 GroundStation0) 12.81)
	(= (slew_time GroundStation0 Planet8) 12.81)
	(= (slew_time Planet8 GroundStation1) 49.08)
	(= (slew_time GroundStation1 Planet8) 49.08)
	(= (slew_time Planet8 GroundStation2) 31.01)
	(= (slew_time GroundStation2 Planet8) 31.01)
	(= (slew_time Planet8 Star3) 61.47)
	(= (slew_time Star3 Planet8) 61.47)
	(= (slew_time Planet8 Phenomenon4) 83.25)
	(= (slew_time Phenomenon4 Planet8) 83.25)
	(= (slew_time Planet8 Planet5) 2.349)
	(= (slew_time Planet5 Planet8) 2.349)
	(= (slew_time Planet8 Phenomenon6) 33.81)
	(= (slew_time Phenomenon6 Planet8) 33.81)
	(= (slew_time Planet8 Planet7) 17.58)
	(= (slew_time Planet7 Planet8) 17.58)
	(= (slew_time Planet9 GroundStation0) 48.48)
	(= (slew_time GroundStation0 Planet9) 48.48)
	(= (slew_time Planet9 GroundStation1) 10.94)
	(= (slew_time GroundStation1 Planet9) 10.94)
	(= (slew_time Planet9 GroundStation2) 4.27)
	(= (slew_time GroundStation2 Planet9) 4.27)
	(= (slew_time Planet9 Star3) 86.36)
	(= (slew_time Star3 Planet9) 86.36)
	(= (slew_time Planet9 Phenomenon4) 7.313)
	(= (slew_time Phenomenon4 Planet9) 7.313)
	(= (slew_time Planet9 Planet5) 20.61)
	(= (slew_time Planet5 Planet9) 20.61)
	(= (slew_time Planet9 Phenomenon6) 13.41)
	(= (slew_time Phenomenon6 Planet9) 13.41)
	(= (slew_time Planet9 Planet7) 2.196)
	(= (slew_time Planet7 Planet9) 2.196)
	(= (slew_time Planet9 Planet8) 15.69)
	(= (slew_time Planet8 Planet9) 15.69)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite1 GroundStation1)
	(have_image Phenomenon4 spectrograph0)
	(have_image Planet5 thermograph1)
	(have_image Planet7 image2)
	(have_image Planet8 image2)
	(have_image Planet9 thermograph1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite1 groundstation0 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 groundstation0)
   changed: (fuel satellite1) from 105 to 92.19, (fuel-used) from 0 to 12.81
   goals met: 0 of 6
2. (turn_to satellite1 phenomenon4 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 92.19 to 59.58, (fuel-used) from 12.81 to 45.42
   goals met: 0 of 6
3. (turn_to satellite0 groundstation1 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 129 to 121.159, (fuel-used) from 45.42 to 53.261
   goals met: 0 of 6
4. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 6
5. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
6. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 6
7. (turn_to satellite0 planet7 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet7)
   changed: (fuel satellite0) from 121.159 to 120.644, (fuel-used) from 53.261 to 53.7765
   goals met: 0 of 6
8. (take_image satellite0 planet7 instrument0 image2)
   added: (have_image planet7 image2)
   changed: (data_capacity satellite0) from 1000 to 929, (data-stored) from 0 to 71
   goals met: 1 of 6
9. (turn_to satellite0 phenomenon4 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 phenomenon4)
   changed: (fuel satellite0) from 120.644 to 68.2835, (fuel-used) from 53.7765 to 106.137
   goals met: 1 of 6
10. (turn_to satellite1 groundstation1 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 59.58 to 43.26, (fuel-used) from 106.137 to 122.457
   goals met: 2 of 6
11. (turn_to satellite0 planet5 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 68.2835 to 62.0485, (fuel-used) from 122.457 to 128.692
   goals met: 2 of 6
12. (turn_to satellite0 planet8 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet8)
   changed: (fuel satellite0) from 62.0485 to 59.6995, (fuel-used) from 128.692 to 131.041
   goals met: 2 of 6
13. (take_image satellite0 planet8 instrument0 image2)
   added: (have_image planet8 image2)
   changed: (data_capacity satellite0) from 929 to 803, (data-stored) from 71 to 197
   goals met: 3 of 6
14. (turn_to satellite0 planet5 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 59.6995 to 57.3505, (fuel-used) from 131.041 to 133.389
   goals met: 3 of 6
15. (turn_to satellite0 phenomenon4 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon4)
   changed: (fuel satellite0) from 57.3505 to 51.1155, (fuel-used) from 133.389 to 139.625
   goals met: 3 of 6
16. (take_image satellite0 phenomenon4 instrument0 spectrograph0)
   added: (have_image phenomenon4 spectrograph0)
   changed: (data_capacity satellite0) from 803 to 548, (data-stored) from 197 to 452
   goals met: 4 of 6
17. (turn_to satellite1 planet7 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 43.26 to 42.7445, (fuel-used) from 139.625 to 140.14
   goals met: 3 of 6
18. (turn_to satellite1 groundstation1 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 42.7445 to 42.229, (fuel-used) from 140.14 to 140.656
   goals met: 4 of 6
19. (turn_to satellite1 planet7 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 42.229 to 41.7135, (fuel-used) from 140.656 to 141.171
   goals met: 3 of 6
20. (turn_to satellite1 groundstation1 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 41.7135 to 41.198, (fuel-used) from 141.171 to 141.687
   goals met: 4 of 6
21. (turn_to satellite1 planet7 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 41.198 to 40.6825, (fuel-used) from 141.687 to 142.202
   goals met: 3 of 6
22. (turn_to satellite1 star3 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star3)
   changed: (fuel satellite1) from 40.6825 to 39.0215, (fuel-used) from 142.202 to 143.863
   goals met: 3 of 6
23. (calibrate satellite1 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 3 of 6
24. (turn_to satellite1 planet7 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 39.0215 to 37.3605, (fuel-used) from 143.863 to 145.524
   goals met: 3 of 6
25. (turn_to satellite1 planet9 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet9)
   changed: (fuel satellite1) from 37.3605 to 35.1645, (fuel-used) from 145.524 to 147.72
   goals met: 3 of 6
26. (turn_to satellite1 phenomenon4 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 35.1645 to 27.8515, (fuel-used) from 147.72 to 155.033
   goals met: 3 of 6
27. (turn_to satellite1 planet5 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 planet5)
   changed: (fuel satellite1) from 27.8515 to 21.6165, (fuel-used) from 155.033 to 161.268
   goals met: 3 of 6
28. (take_image satellite1 planet5 instrument2 thermograph1)
   added: (have_image planet5 thermograph1)
   changed: (data_capacity satellite1) from 1000 to 790, (data-stored) from 452 to 662
   goals met: 4 of 6
29. (turn_to satellite1 phenomenon4 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 21.6165 to 15.3815, (fuel-used) from 161.268 to 167.503
   goals met: 4 of 6
30. (turn_to satellite1 planet9 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 planet9)
   changed: (fuel satellite1) from 15.3815 to 8.0685, (fuel-used) from 167.503 to 174.816
   goals met: 4 of 6
31. (take_image satellite1 planet9 instrument2 thermograph1)
   added: (have_image planet9 thermograph1)
   changed: (data_capacity satellite1) from 790 to 528, (data-stored) from 662 to 924
   goals met: 5 of 6
32. (turn_to satellite1 planet7 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 8.0685 to 5.8725, (fuel-used) from 174.816 to 177.012
   goals met: 5 of 6
33. (turn_to satellite1 groundstation1 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 5.8725 to 5.357, (fuel-used) from 177.012 to 177.528
   goals met: 6 of 6
